## Introduction

#### Our goals today are to be able to: <br/>

- Investigate table data in Pandas
- Manipulate Pandas DataFrames

In [1]:
# list comprehension
# in-line for loops

In [2]:
list_of_squares = []
for x in range(1,11):
    list_of_squares.append(x**2)

print(list_of_squares)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [3]:
list_of_squares = [x**2 for x in range(1,11)]

In [4]:
list_of_squares

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [ ]:
# tuple comprehension

In [5]:
list_of_squares = tuple(x**2 for x in range(1,11))

In [6]:
list_of_squares

(1, 4, 9, 16, 25, 36, 49, 64, 81, 100)

In [ ]:
# dictionary comprehension

In [11]:
squares_dict = {x: x**2 for x in range(1,11)}

In [12]:
{val ** .5 for key, val in squares_dict.items()}

{1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0}

In [7]:
list_of_squares = [x**2 for x in range(1,11) if x % 2 ==1]

In [8]:
list_of_squares

[1, 9, 25, 49, 81]

In [ ]:
list_of_squares = [x**2 for x in range(1,11) if x % 2 ==1]

In [ ]:
# nested list comprehension

### Activation:

![excel2](img/excelpic2.jpg)

Most people have used Microsoft Excel or Google sheets. But what are the limitations of excel?

- [Take a minute to read this article](https://www.bbc.com/news/magazine-22223190)
- make a list of problems excel presents

How is using python different?

Python
- create documentation of processes as you code
- reduces chances for human error
- do "drag and drop"
- repeatable
- transparent

## Pandas

<img src="https://cdn-images-1.medium.com/max/1600/1*9IU5fBzJisilYjRAi-f55Q.png" width=600>  




- The data manipulation capabilities of Pandas are built on top of the numpy library.
- Pandas dataframe object represents a spreadsheet with cell values, column names, and row index labels.

### 1. Importing and reading data with Pandas!

#### Let's use pandas to read some csv files so we can interact with them.

In [20]:
# First, let's check which directory we are in so the files we expect to see are there.
!pwd
!ls

/Users/cathyxu/code/FlatironDS/hbs-ds-060120/module-1/day-5-pandas-1
data                 img                  pandas-1-Cathy.ipynb

In [22]:
!ls -la

total 56
drwxr-xr-x   6 cathyxu  staff    192 Jun  5 11:05 .
drwxr-xr-x   7 cathyxu  staff    224 Jun  5 10:33 ..
drwxr-xr-x   3 cathyxu  staff     96 Jun  5 10:37 .ipynb_checkpoints
drwxr-xr-x   4 cathyxu  staff    128 Jun  5 10:33 data
drwxr-xr-x  12 cathyxu  staff    384 Jun  5 10:33 img
-rwxr-xr-x   1 cathyxu  staff  26890 Jun  5 11:05 pandas-1-Cathy.ipynb

In [21]:
!ls -la data
# la: list format, long format

total 16
drwxr-xr-x  4 cathyxu  staff  128 Jun  5 10:33 .
drwxr-xr-x  6 cathyxu  staff  192 Jun  5 11:05 ..
-rw-r--r--  1 cathyxu  staff   62 Jun  5 10:33 example1.csv
-rw-r--r--  1 cathyxu  staff  238 Jun  5 10:33 made_up_jobs.csv

In [16]:
import pandas as pd

example_csv = pd.read_csv('data/example1.csv')

In [17]:
example_csv

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

In [18]:
!cat data/example1.csv

Title1,Title2,Title3
one,two,three
example1,example2,example3

In [23]:
type(example_csv)

pandas.core.frame.DataFrame

There is also `read_excel`, `read_html`, and many other pandas `read_` functions.  
http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [25]:
# The dataframe is really a collection of 1-dimensional objects.
example_csv.Title1

0         one
1    example1
Name: Title1, dtype: object

In [26]:
type(example_csv.Title1)

pandas.core.series.Series

In [27]:
example_csv.describe()

          Title1 Title2 Title3
count          2      2      2
unique         2      2      2
top     example1    two  three
freq           1      1      1

In [28]:
example_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Title1  2 non-null      object
 1   Title2  2 non-null      object
 2   Title3  2 non-null      object
dtypes: object(3)
memory usage: 176.0+ bytes

Try loading in the example file in the `data` directory called `made_up_jobs.csv` using pandas.

In [51]:
!cat data/made_up_jobs.csv

ID,Name,Job,Years Employed
0,Bob Bobberty,Underwater Basket Weaver,13
1,Susan Smells,Salad Spinner,5
2,Alex Lastname,Productivity Manager,2
3,Rudy P.,Being cool,55
4,Rudy G.,Being compared to Rudy P,50
5,Sir Wellington,Cheese Stacker, 10

In [31]:
# read in your csv here!
muj = pd.read_csv('data/made_up_jobs.csv')
# muj = pd.read_csv('data/made_up_jobs.csv', index_col = 'ID') 
# ^this tells to us ID column as index, and not add a default index. 
# remember that it's nice to be able to look at your data, so let's do that here, too.
muj

   ID            Name                       Job  Years Employed
0   0    Bob Bobberty  Underwater Basket Weaver              13
1   1    Susan Smells             Salad Spinner               5
2   2   Alex Lastname      Productivity Manager               2
3   3         Rudy P.                Being cool              55
4   4         Rudy G.  Being compared to Rudy P              50
5   5  Sir Wellington            Cheese Stacker              10

In [30]:
muj.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              6 non-null      int64
 1   Name            6 non-null      object
 2   Job             6 non-null      object
 3   Years Employed  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [62]:
# muj.Name
# equal to
muj["Name"]

0      Bob Bobberty
1      Susan Smells
2     Alex Lastname
3           Rudy P.
4           Rudy G.
5    Sir Wellington
Name: Name, dtype: object

In [32]:
import numpy as np
random_df= pd.DataFrame(np.random.random((1000,10)))

In [34]:
random_df.tail(10)

,0,1,2,3,4,5,6,7,8,9
990,0.955129,0.267671,0.766385,0.936094,0.791867,0.657955,0.515080,0.342685,0.229001,0.430342
991,0.382448,0.804456,0.119856,0.221074,0.159532,0.464965,0.278495,0.339073,0.985813,0.244248
992,0.562550,0.457075,0.313867,0.234995,0.769664,0.351600,0.931023,0.539995,0.658112,0.458234
993,0.070933,0.823520,0.250106,0.496544,0.726392,0.003241,0.644338,0.118220,0.451684,0.694413
994,0.607277,0.660589,0.611609,0.524959,0.496701,0.167447,0.730559,0.607872,0.785203,0.253976
995,0.297212,0.278611,0.404237,0.367355,0.734704,0.436436,0.642201,0.916010,0.422596,0.247969
996,0.614866,0.114839,0.845188,0.023974,0.909970,0.498138,0.423273,0.391371,0.932509,0.325109
997,0.256213,0.714567,0.196880,0.909522,0.411809,0.953842,0.552009,0.663030,0.593592,0.263552
998,0.531395,0.408267,0.448555,0.838799,0.340272,0.767958,0.003712,0.470759,0.338720,0.323867
999,0.224995,0.304850,0.574963,0.644432,0.800544,0.507965,0.395158,0.318857,0.892282,0.280899

In [36]:
random_df.size
random_df.shape

(1000, 10)

In [37]:
pd.DataFrame([[1,2,3],[4, None,6]])

   0    1  2
0  1  2.0  3
1  4  NaN  6

### 2. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [38]:
fruits = ['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [39]:
fruits_series = pd.Series(fruits)

print(fruits_series)
type(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

pandas.core.series.Series

In [40]:
[x.upper() for x in fruits]

['APPLE', 'ORANGE', 'WATERMELON', 'LEMON', 'MANGO']

In [41]:
fruits

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index manually for a **series objects**.

In [42]:
ind = ['a', 'b', 'c', 'd', 'e']

fruits_series = pd.Series(fruits, index=ind)

print(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [43]:
list_of_lists = [['cat'], ['dog'], ['horse'], ['cow'], ['macaw']]

# create custom indices for your series
ind = ['a', 'b', 'c', 'd', 'e']

# grabbing the first element of each x, and lower case it
elements=[x[0].lower() for x in list_of_lists]

# create the series using your list objects
# You can use either a for loop or also pd.Series
list_of_lists_series = pd.Series(elements, index=ind)

# print your series
print(list_of_lists_series)
type(list_of_lists_series)

a      cat
b      dog
c    horse
d      cow
e    macaw
dtype: object

pandas.core.series.Series

In [44]:
list_of_lists_series

a      cat
b      dog
c    horse
d      cow
e    macaw
dtype: object

In [49]:
df = pd.DataFrame()
# df["fruits"] = fruits_series
df["animals"]=list_of_lists_series

In [50]:
df

       fruits animals
a       Apple     cat
b      Orange     dog
c  Watermelon   horse
d       Lemon     cow
e       Mango   macaw

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [95]:
# Dictionary with list object in values (dictionary of lists)
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

In [84]:
student_dict.values()

dict_values([['Samantha', 'Alex', 'Dante'], ['35', '17', '26'], ['Houston', 'Seattle', 'New york']])

In [85]:
# students_df = pd.DataFrame(student_dict.values) #passing in list of lists works

students_df = pd.DataFrame(student_dict)
                           
students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [79]:
# taking a list of dictionaries: 
student_list = [{'name': 'Samantha', 'age': '35', 'city': 'Houston'},
               {'name': 'Alex', 'age': '17', 'city': 'Seattle'},
               {'name': 'Dante', 'age': '26', 'city': 'New york'}]

In [59]:
students_df2 = pd.DataFrame(student_list)
students_df2

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [ ]:
#to find data types of columns
students_df.dtypes

Let's change the data type of ages to int.

In [64]:
# We can also change a columns type but the change has to make sense.
# recreating age string into integer type age
students_df.age = students_df.age.astype(int)

#Uncomment line below and observe what happens when trying to convert student's name to int or float
#students_df.name = students_df.name.astype(int)

#How about what happens converting numeric to string
students_df.age = students_df.age.astype(str)

students_df.dtypes

name    object
age     object
city    object
dtype: object

In [65]:
students_df

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [63]:
school_ids = ['1111', '1145', '0096']

# Notice here we use pd.DataFrame not pd.Series as we did for a pandas series.
students_df = pd.DataFrame(student_dict, index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [67]:
# renaming index
students_df.index = students_df.index.rename('id')

In [68]:
students_df

          name age      city
id
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Using Pandas, we can also rename column names.

In [69]:
students_df.columns

Index(['name', 'age', 'city'], dtype='object')

In [72]:
# students_df.columns = ['NAME', 'AGE', 'HOME']
# or:
students_df.columns = [x.upper() for x in students_df.columns]
# getting rid of spaces in python string: 
students_df.columns = [x.replace(' ', '').upper() for x in students_df.columns]
students_df.head()

          NAME AGE      HOME
id
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Or, we can also change the column names using the rename function.

In [ ]:
students_df.rename(columns={"AGE": "YEARS"})

In [73]:
# Notice what happens when we print students_df: you didn't pass it on to columns
# to save: 
students_df = students_df.rename(columns={"AGE": "YEARS"})
students_df

          NAME AGE      HOME
id
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [74]:
# If you want the file to save over itself, use the option `inplace = True`. Pandas doesn't recommend the inplae parameter.
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
students_df.head()

          NAME YEARS      HOME
id
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

Similarly, there is a tool to remove rows and columns from your DataFrame

In [75]:
students_df.drop(columns=['YEARS', 'HOME'])

          NAME
id
1111  Samantha
1145      Alex
0096     Dante

In [94]:
#Notice again what happens if we print students_df 
students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [77]:
students_df.drop(columns=['YEARS', 'HOME'], inplace=True)
students_df

          NAME
id
1111  Samantha
1145      Alex
0096     Dante

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

In [ ]:
# Dropping rows
students_df.drop([1],axis = 0)

In [92]:
my_df = pd.DataFrame([1,2,3],[4,None,6])
my_df

     0
4    1
NaN  2
6    3

In [ ]:
my_df.dropna()

### 3. Filtering Data Using Pandas
There are several ways to grab particular data from a DataFrame. 
- Python lists allow for selection of data only through integer location. 
- You can use a single integer or slice notation to make the selection but NOT a list of integers.
- Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [ ]:
l = [1, 2, 3, 4, 5]
l[[0, 3]]

### DataFrames can be indexed by column name (label) or row name (index) or by position.   
#### The `.loc` method is used for indexing by name.  
#### While `.iloc` is used for indexing by number.

In [141]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

In [98]:
students_df.loc[:, 'name']

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [100]:
students_df.loc[0:1]

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

### Let's take a look at `.iloc`
#### `.iloc` takes slices based on index position.
#### `.iloc` stands for integer location so that should help with remember what it does
#### `.iloc`[row , column]

In [101]:
# returns the first row
students_df.iloc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [102]:
# returns the first column
students_df.iloc[:, 0]

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [106]:
students_df.loc[0:2]

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [103]:
# returns first two rows notice that ILOC performs regular python slicing.
students_df.iloc[0:2]

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

In [107]:
# returns the first two columns
students_df.iloc[:, 0:2]

       name age
0  Samantha  35
1      Alex  17
2     Dante  26

In [108]:
# returns first row and columns 1 and 2
students_df.iloc[0:1, 0:2]

       name age
0  Samantha  35

### How would we use `.iloc` to return the last item in the last row?

In [109]:
# return the last item in the last row using iloc
students_df.iloc[-1,-1]

'New york'

### How would we use `.iloc` to return the last item in the last column?

In [110]:
# return the last item in the last column using iloc
students_df.iloc[-1,-1]

'New york'

### What if we only want certain columns or rows?

In [113]:
# Don't do students_df.iloc[0, 2]
# This is a list referring to rows, and asking for row 0 and row 2: 
students_df.iloc[[0, 2]]

       name age      city
0  Samantha  35   Houston
2     Dante  26  New york

In [114]:
students_df.iloc[[0, 2], [0, 2]]
# This cuts out "age" column and row 1.

       name      city
0  Samantha   Houston
2     Dante  New york

### Let's take a look at `.loc`
#### Label based method. 
#### Names or labels of the index is used when taking slices.
#### Also supports boolean subsetting.

In [115]:
# We will use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.
students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [119]:
# returns the student information associated with index 0
students_df.loc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [117]:
# returns the student information for row index 0 to 2 inclusive.
# note iloc would return normal python slicing not including 2 as demonstrated above.
students_df.loc[0:2]

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [ ]:
# returns the column labeled 'age'
students_df.loc[:, 'age']

In [120]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age"
students_df.loc[1:2, 'age']

1    17
2    26
Name: age, dtype: object

In [121]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age to city (inclusive)"
students_df.loc[1:2, 'age':'city']

  age      city
1  17   Seattle
2  26  New york

In [122]:
# What should we get?
students_df.loc[1:2, ['name', 'city']]

    name      city
1   Alex   Seattle
2  Dante  New york

In [123]:
# How about?
students_df.loc[[0, 2], ['name', 'city']]

       name      city
0  Samantha   Houston
2     Dante  New york

In [124]:
# if index rearranged
school_ids = ['5', '11', '3']
students_df = pd.DataFrame(student_dict, index=school_ids)

In [125]:
students_df

        name age      city
5   Samantha  35   Houston
11      Alex  17   Seattle
3      Dante  26  New york

In [134]:
# What should we get now?
students_df.loc[[0, 2], ['name', 'city']]

KeyError: "None of [Int64Index([0, 2], dtype='int64', name='name')] are in the [index]"

In [129]:
students_df.loc["5":"11", ['name', 'city']]

        name     city
5   Samantha  Houston
11      Alex  Seattle

In [133]:
# What should we get now?

KeyError: "None of [Index(['5', '11'], dtype='object', name='name')] are in the [index]"

In [140]:
students_df

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [153]:
# how do you use iloc when index is string? ?????
new_df = students_df.reset_index().set_index("name")

In [154]:
new_df

          index age      city       state
name
Samantha      0  35   Houston       Texas
Alex          1  17   Seattle  Washington
Dante         2  26  New york    New York
Samantha      3  21   Atlanta     Georgia

In [130]:
students_df.set_index("name", inplace=True)
students_df

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [135]:
students_df.loc[['Samantha']]

         age     city
name
Samantha  35  Houston

In [136]:
# Subsetting nonconsecutive rows
students_df.loc[['Samantha', 'Dante']]

         age      city
name
Samantha  35   Houston
Dante     26  New york

In [139]:
# Samantha to the end
students_df.loc['Alex':]

      age      city
name
Alex   17   Seattle
Dante  26  New york

In [ ]:
# return the first and last rows using one loc command

### Boolean Subsetting

In [146]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante', 'Samantha'],
    'age': ['35', '17', '26', '21'],
    'city': ['Houston', 'Seattle', 'New york', 'Atlanta'],
    'state': ['Texas', 'Washington', 'New York', 'Georgia']
}

students_df = pd.DataFrame(student_dict)

In [147]:
# The statement data[name] == Samantha] produces a Pandas Series with a True/False value for every row
# in the data DataFrame, where there are True values for the rows where the name is Samantha.
# These type of boolean arrays can be passed directly to the .loc indexer.
students_df.loc[students_df['name'] == 'Samantha']

       name age     city    state
0  Samantha  35  Houston    Texas
3  Samantha  21  Atlanta  Georgia

In [148]:
# What about if we only want the city and state of the selected students with the name Samantha?
students_df.loc[students_df['name'] == 'Samantha', ['city', 'state']]

      city    state
0  Houston    Texas
3  Atlanta  Georgia

In [151]:
# What amount if we want to select a student of a specific age?
# students_df.loc[students_df['age'] == '21']
students_df.loc[students_df.age == '21']

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [152]:
# What amount if we want to select a student of a specific age?
# don't use "and"
students_df.loc[(students_df['age'] == '21') &
                (students_df['city'] == 'Atlanta')]

       name age     city    state
3  Samantha  21  Atlanta  Georgia